[
    {
        "date": " 20 Aug 2023 ",
        "title": " Recruiting New Members ",
        "tag": " Recruitment ",
        "innertitle": " Recruiting new members for CSpace ",
        "description": " 🌟 <b>Join Our Team: PR & Business Communications Specialist</b> 🌟 <br><br>\n\nAre you a dynamic communicator with a passion for sustainability and startups? Are you passionate about crafting compelling narratives and building meaningful relationships? If so, we have an exciting opportunity for you to play a pivotal role in our growing potential venture! \n<br><br>\n\n<b>About Us:</b><br>\nAt CSpace, we are dedicated to revolutionizing the way industries approach sustainability. Our cutting-edge cloud-based platform, CSpace, will be making waves by automating Task Force on Climate-related Financial Disclosures (TCFD) and Task Force on Nature-related Financial Disclosures (TNFD) calculations, all while providing real-time insights through AI tools. As we continue to shape the future of sustainablity calculations, we are seeking a passionate PR & Business Communications Specialist to join our team.\n<br><br>\n\n<b>What You'll Do:</b><br>\n✅ <b>Social Media Maven:</b> You'll curate and manage our social media presence, engaging our audience with captivating content that reflects our mission and values. Your creative flair will drive awareness and foster meaningful connections within the sustainability and startup communities.<br>\n✅ <b>Business Liaison:</b> Communication is your forte! You'll serve as the bridge between our company and potential partners, nurturing relationships with companies that share our vision. Your impeccable Japanese language skills (both verbal and written) will be essential in conveying our message effectively.<br>\n✅ <b>Document Dynamo:</b> From business proposals to informative documents, you'll craft written materials that resonate with our target audience. Your eye for detail and ability to convey complex concepts in a clear, concise manner will set us apart.<br>\n<br>\n\n<b>Qualifications:</b><br>\n✅ Proficiency in both spoken and written Japanese is a must.<br>\n✅ A genuine interest in sustainability, startups, or both – your enthusiasm will be contagious!<br>\n✅ Preferably a background in PR, business communications, or a related field.<br>\n✅ willingness to learn new skills.<br>\n<br>\n\n<b>What We Offer:</b><br>\n✅ Joining our team means becoming a driving force in the sustainablity movement.<br> \n✅ You'll work in a collaborative, forward-thinking environment where your ideas are valued and your growth is nurtured.<br> \n✅ An environment to make a meaningful impact.<br>\n<br>\nReady to embark on a journey that combines your communication prowess with your passion for sustainability and startups? Contact us through the form below. Together, let's shape a more sustainable future!\n<br> \n<br>\n\n📩 Apply Now: <a href=https://forms.gle/9dM1Q8JgURywSRgA8 target=_blank> CSpace application form </a>\n<br><br>\n\n<p><font color=\"green\">#JoinTheCSpaceTeam #PRandCommunications #SustainabilityRevolution</font></p>",
        "link": ""
    },
    {
        "date": " 8 Jul 2023 ",
        "title": " CSpace landing page launched! ",
        "tag": " Website ",
        "innertitle": " Introducing CSpace, an unified TCFD and TNFD calculation platform ",
        "description": " In the era of heightened environmental consciousness and increasing regulatory scrutiny, we are thrilled to introduce CSpace, a cutting-edge cloud-based platform poised to reshape how industries approach sustainability assessment. CSpace stands for carbon neutral worksapce and aims to be at the forefront of innovation, offering a comprehensive solution for conducting Task Force on Climate-related Financial Disclosures (TCFD) and Task Force on Nature-related Financial Disclosures (TNFD) calculations. Gone are the days of laborious and error-prone manual calculations. With CSpace, industries now have access to a powerful suite of artificial intelligence tools that automate these intricate assessments, providing real-time feedback and insights that enable informed decision-making.\n<br>\nCSpace's approach to sustainability analysis heralds a new era of efficiency and accuracy. By seamlessly integrating advanced AI algorithms, the platform streamlines the TCFD and TNFD calculations, alleviating the complexities that often deter industries from embracing sustainability practices. Through its intuitive user interface, professionals can effortlessly input their data, while CSpace works tirelessly in the background, transforming raw information into actionable intelligence. Real-time feedback mechanisms empower businesses to identify risks and opportunities promptly, empowering them to proactively navigate the evolving landscape of sustainable finance and responsible resource management. CSpace is more than just a tool; it's a game-changer, equipping industries with the tools they need to navigate the complex intersection of economics, nature, and sustainability with confidence and precision. ",
        "link": ""
    },
    {
        "date": " 1 Oct 2023 ",
        "title": " 🎉 TomoPro×CSpace: Join Us in Crowdfunding for a Greener Future! 🎉 ",
        "tag": " Startup ",
        "innertitle": " 🚀 We're Thrilled to Announce CSpace’s Selection for the TomoPro Crowdfunding Initiative! 🚀 ",
        "description": " We are overjoyed to announce that CSpace has been handpicked for the esteemed Tohoku University Fund’s \"TomoPro\" program. A platform where innovation and community support converge, TomoPro is dedicated to empowering students to shape the future, offering a space where visionary ideas come to life through collective effort and sponsorship.<br><br>\n\nCSpace is honored to stand alongside 13 other pioneering projects, each selected for their potential to make waves of positive change. Through TomoPro, we invite the global community to join hands with us, amplifying our impact and turning our sustainable vision into reality.<br><br>\n\nThis is more than a crowdfunding opportunity - it’s a call to unite, a journey to weave sustainability into the fabric of our everyday lives and businesses. By supporting CSpace, you’re championing a future where eco-friendly tools aren’t just available but are an integral part of our world, driving us towards a planet where green is the status quo.<br><br>\n\n➡️ Stand With CSpace: <a href=https://www.kikin.tohoku.ac.jp/project/tomopro/2023/pj_014_2023>私たちを応援してください！</a> <br><br> \n➡️ Explore TomoPro 2023 Projects: <a href=https://www.kikin.tohoku.ac.jp/tomopro/2023>すべてのTomoPro 2023プロジェクトを発見する</a>",
        "link": ""
    }
]